{
	"experiences": [
		{
			"id": 3,
			"title": "Ingeniero de TI Junior",
			"company": "Chambre Vaudoise du Commerce et de l'Industrie (CVCI)",
			"duration": "Posición actual, comenzada en octubre de 2024",
			"location": "Lausana, Vaud, Suiza · Presencial (Híbrido)",
			"description": "Como ingeniero de TI junior, he tenido la oportunidad de trabajar en diversos y complejos proyectos técnicos en un entorno dinámico. Esta experiencia ha fortalecido mis habilidades en administración de sistemas, ciberseguridad y gestión de infraestructura de red. Trabajar con herramientas de Microsoft (Office 365, Azure) me ha permitido especializarme en entornos de nube y automatización. También he desarrollado un enfoque proactivo para resolver problemas técnicos mientras colaboro estrechamente con equipos multidisciplinarios para proporcionar soluciones innovadoras y personalizadas. Mi rol también me ha permitido participar en la planificación estratégica de proyectos de TI, mejorar procesos existentes y documentar procedimientos técnicos para asegurar la continuidad y eficiencia operativa.",
			"tasks": [
				"Gestionar el acceso de usuarios y asegurar su seguridad implementando políticas de seguridad robustas.",
				"Mantener y administrar sistemas de TI, asegurando su disponibilidad y rendimiento.",
				"Resolver problemas técnicos complejos analizando las causas raíz e implementando soluciones sostenibles.",
				"Supervisar proyectos de TI en curso y futuros coordinando recursos y cumpliendo plazos.",
				"Colaborar con equipos en soluciones para clientes entendiendo sus necesidades y proponiendo soluciones personalizadas.",
				"Utilizar herramientas de Microsoft como Office 365 y Azure para automatizar procesos y mejorar la eficiencia.",
				"Participar en la planificación estratégica de proyectos de TI identificando oportunidades de mejora y proponiendo iniciativas innovadoras.",
				"Documentar procedimientos técnicos y capacitar a los usuarios para asegurar un uso óptimo del sistema."
			],
			"skills": [
				"Microsoft Azure",
				"Microsoft Dynamics",
				"ERP Microsoft Dynamics",
				"CRM Microsoft Dynamics",
				"Administración de Microsoft 365",
				"Microsoft Dynamics 365",
				"Microsoft Power Automate",
				"Automatización de Sistemas",
				"Administración de Redes",
				"Sistemas de Gestión de Seguridad",
				"Computación en la Nube",
				"Ciberseguridad",
				"Seguridad de Redes",
				"Virtualización",
				"Mejora de Procesos",
				"Gestión de Proyectos de TI",
				"Resolución de Problemas Complejos",
				"Colaboración Interdisciplinaria",
				"Soporte Técnico Avanzado",
				"Planificación Estratégica de TI",
				"Documentación Técnica",
				"Capacitación de Usuarios",
				"Análisis de Causa Raíz",
				"Coordinación de Recursos",
				"Automatización de Procesos"
			],
			"logo": "/assets/cvci_logo.png"
		},
		{
			"id": 2,
			"title": "Desarrollador de Software (Estudiante)",
			"company": "42 Lausanne",
			"duration": "Octubre 2023 - Octubre 2024 · 1 año",
			"location": "Renens, Vaud, Suiza · Presencial (Híbrido)",
			"description": "Mi experiencia en 42 Lausanne fue una inmersión completa en el desarrollo de software y metodologías de resolución de problemas. Adquirí habilidades avanzadas de programación, aprendí a colaborar eficazmente en proyectos grupales y desarrollé soluciones innovadoras. Esta formación fortaleció mi rigor, autonomía y adaptabilidad en un entorno exigente. También tuve la oportunidad de trabajar en proyectos reales, lo que me permitió poner en práctica mis conocimientos teóricos y desarrollar una comprensión profunda de los ciclos de desarrollo de software.",
			"tasks": [
				"Completar proyectos intensivos de desarrollo de software, desde el diseño hasta la producción.",
				"Colaborar con otros estudiantes en un entorno innovador y estimulante, promoviendo el aprendizaje práctico.",
				"Adquirir habilidades en la resolución de problemas complejos y optimización de código.",
				"Aprender y aplicar las mejores prácticas de programación, incluidos patrones de diseño y principios SOLID.",
				"Trabajar en proyectos de forma independiente con plazos estrictos, asegurando la calidad y el rendimiento del código.",
				"Utilizar herramientas de control de versiones como Git para el control de versiones y la colaboración.",
				"Participar en revisiones de código y sesiones de programación en pareja para mejorar la calidad del código y compartir conocimientos."
			],
			"skills": [
				"C",
				"C++",
				"Python",
				"Linux",
				"Scripting en Shell",
				"Git",
				"Algoritmos",
				"Resolución de Problemas",
				"Colaboración en Equipo",
				"Desarrollo Web",
				"Autonomía",
				"Rigor",
				"Diseño de Soluciones de Software",
				"Creatividad Técnica",
				"Gestión de Proyectos de Software",
				"Optimización de Código",
				"Análisis de Rendimiento",
				"Docker",
				"HTML",
				"CSS",
				"JavaScript",
				"Bootstrap",
				"Django",
				"Redes",
				"MySQL",
				"PostgreSQL",
				"HTTP",
				"HTTPS",
				"PHP",
				"Gráficos 2D",
				"Gráficos 3D",
				"Multithreading",
				"Patrones de Diseño",
				"Principios SOLID",
				"Revisión de Código",
				"Programación en Pareja"
			],
			"logo": "/assets/42_logo.png"
		},
		{
			"id": 1,
			"title": "Asistente de Farmacia",
			"company": "Galenica",
			"duration": "Octubre 2019 - Marzo 2024 · 4 años 6 meses",
			"location": "Ginebra, Suiza · Presencial (Farmacia Amavita)",
			"description": "Mi rol como asistente de farmacia me permitió adquirir habilidades esenciales en la gestión de inventarios, el uso de herramientas digitales especializadas y el cumplimiento de estrictas regulaciones farmacéuticas. Esta experiencia me enseñó a trabajar metódicamente mientras mantenía un alto nivel de servicio al cliente. También fortalecí mi capacidad para colaborar eficazmente con equipos para integrar innovaciones tecnológicas y mejorar los procesos logísticos. Desarrollé una comprensión profunda de los productos farmacéuticos y las necesidades de los clientes, lo que me permitió proporcionar asesoramiento preciso y personalizado. Además, participé en formación continua para mantenerme al día con los últimos avances en el campo farmacéutico.",
			"tasks": [
				"Asesorar a los clientes y dispensar medicamentos según las prescripciones médicas.",
				"Gestionar inventarios, realizar pedidos y optimizar procesos para evitar desabastecimientos.",
				"Utilizar herramientas ERP para la gestión farmacéutica, incluida la trazabilidad de medicamentos.",
				"Cumplir con las regulaciones farmacéuticas y asegurar que las prácticas de la farmacia sean conformes.",
				"Mejorar los flujos de trabajo digitales y logísticos para aumentar la eficiencia operativa.",
				"Colaborar con el equipo para integrar innovaciones tecnológicas y mejorar los servicios ofrecidos.",
				"Participar en formación continua para mantenerse al día con nuevas regulaciones y tecnologías."
			],
			"skills": [
				"ERP",
				"Software de Gestión Farmacéutica",
				"Gestión de Inventarios",
				"Cumplimiento Normativo",
				"Optimización de Flujos de Trabajo",
				"Servicio al Cliente",
				"Colaboración en Equipo",
				"Adaptabilidad Tecnológica",
				"Gestión de Inventarios",
				"Técnicas de Asesoramiento al Cliente",
				"Organización Logística",
				"Conocimiento Farmacéutico",
				"Mejora Continua de Procesos",
				"Formación Continua",
				"Trazabilidad de Medicamentos",
				"Asesoramiento Personalizado",
				"Comprensión de Productos Farmacéuticos"
			],
			"logo": "/assets/galenica_logo.png"
		}
	]
}