{
	"experiences": [
		{
			"id": 3,
			"title": "Junior IT-Ingenieur",
			"company": "Chambre du Commerce et de l'Industrie (CVCI)",
			"duration": "Aktuelle Position, begonnen im Oktober 2024",
			"location": "Lausanne, Waadt, Schweiz · Vor Ort (Hybrid)",
			"description": "Als Junior IT-Ingenieur hatte ich die Möglichkeit, an verschiedenen und komplexen technischen Projekten in einer dynamischen Umgebung zu arbeiten. Diese Erfahrung hat meine Fähigkeiten in der Systemadministration, Cybersicherheit und Netzwerk-Infrastruktur-Management gestärkt. Die Arbeit mit Microsoft-Tools (Office 365, Azure) hat es mir ermöglicht, mich auf Cloud- und Automatisierungsumgebungen zu spezialisieren. Ich habe auch einen proaktiven Ansatz zur Lösung technischer Probleme entwickelt und eng mit interdisziplinären Teams zusammengearbeitet, um maßgeschneiderte und innovative Lösungen zu bieten. Meine Rolle hat es mir auch ermöglicht, an der strategischen Planung von IT-Projekten teilzunehmen, bestehende Prozesse zu verbessern und technische Verfahren zu dokumentieren, um Kontinuität und betriebliche Effizienz zu gewährleisten.",
			"tasks": [
				"Verwalten des Benutzerzugangs und Sicherstellen ihrer Sicherheit durch Implementierung robuster Sicherheitsrichtlinien.",
				"Wartung und Verwaltung von IT-Systemen, um deren Verfügbarkeit und Leistung sicherzustellen.",
				"Lösen komplexer technischer Probleme durch Analyse der Ursachen und Implementierung nachhaltiger Lösungen.",
				"Überwachen laufender und bevorstehender IT-Projekte durch Koordination von Ressourcen und Einhaltung von Fristen.",
				"Zusammenarbeit mit Teams an Kundenlösungen durch Verständnis ihrer Bedürfnisse und Vorschlagen maßgeschneiderter Lösungen.",
				"Verwendung von Microsoft-Tools wie Office 365 und Azure zur Automatisierung von Prozessen und Verbesserung der Effizienz.",
				"Teilnahme an der strategischen Planung von IT-Projekten durch Identifizierung von Verbesserungsmöglichkeiten und Vorschlagen innovativer Initiativen.",
				"Dokumentation technischer Verfahren und Schulung von Benutzern, um eine optimale Systemnutzung sicherzustellen."
			],
			"skills": [
				"Microsoft Azure",
				"Microsoft Dynamics",
				"ERP Microsoft Dynamics",
				"CRM Microsoft Dynamics",
				"Microsoft 365 Administration",
				"Microsoft Dynamics 365",
				"Microsoft Power Automate",
				"Systemautomatisierung",
				"Netzwerkadministration",
				"Sicherheitsmanagementsysteme",
				"Cloud Computing",
				"Cybersicherheit",
				"Netzwerksicherheit",
				"Virtualisierung",
				"Prozessverbesserung",
				"IT-Projektmanagement",
				"Komplexe Problemlösung",
				"Interdisziplinäre Zusammenarbeit",
				"Erweiterter technischer Support",
				"IT-Strategieplanung",
				"Technische Dokumentation",
				"Benutzerschulung",
				"Ursachenanalyse",
				"Ressourcenkoordination",
				"Prozessautomatisierung"
			],
			"logo": "/assets/cvci_logo.png"
		},
		{
			"id": 2,
			"title": "Softwareentwickler (Student)",
			"company": "42 Lausanne",
			"duration": "Oktober 2023 - Oktober 2024 · 1 Jahr",
			"location": "Renens, Waadt, Schweiz · Vor Ort (Hybrid)",
			"description": "Meine Erfahrung bei 42 Lausanne war eine vollständige Eintauchen in Softwareentwicklung und Problemlösungsmethoden. Ich erwarb fortgeschrittene Programmierkenntnisse, lernte effektiv in Gruppenprojekten zusammenzuarbeiten und entwickelte innovative Lösungen. Diese Ausbildung stärkte meine Rigorosität, Autonomie und Anpassungsfähigkeit in einer anspruchsvollen Umgebung. Ich hatte auch die Möglichkeit, an realen Projekten zu arbeiten, was mir ermöglichte, mein theoretisches Wissen in die Praxis umzusetzen und ein tiefes Verständnis der Softwareentwicklungszyklen zu entwickeln.",
			"tasks": [
				"Abschluss intensiver Softwareentwicklungsprojekte, von der Konzeption bis zur Produktion.",
				"Zusammenarbeit mit anderen Studenten in einer innovativen und anregenden Umgebung, die Lernen durch Handeln fördert.",
				"Erwerb von Fähigkeiten zur Lösung komplexer Probleme und Optimierung von Code.",
				"Lernen und Anwenden bewährter Programmierpraktiken, einschließlich Entwurfsmuster und SOLID-Prinzipien.",
				"Arbeiten an Projekten unabhängig mit strengen Fristen, Sicherstellung der Codequalität und Leistung.",
				"Verwendung von Versionskontrollwerkzeugen wie Git für Versionskontrolle und Zusammenarbeit.",
				"Teilnahme an Code-Reviews und Pair-Programming-Sitzungen zur Verbesserung der Codequalität und Wissensaustausch."
			],
			"skills": [
				"C",
				"C++",
				"Python",
				"Linux",
				"Shell-Scripting",
				"Git",
				"Algorithmen",
				"Problemlösung",
				"Teamzusammenarbeit",
				"Webentwicklung",
				"Autonomie",
				"Rigorosität",
				"Softwarelösungsdesign",
				"Technische Kreativität",
				"Softwareprojektmanagement",
				"Code-Optimierung",
				"Leistungsanalyse",
				"Docker",
				"HTML",
				"CSS",
				"JavaScript",
				"Bootstrap",
				"Django",
				"Netzwerke",
				"MySQL",
				"PostgreSQL",
				"HTTP",
				"HTTPS",
				"PHP",
				"2D-Grafik",
				"3D-Grafik",
				"Multithreading",
				"Entwurfsmuster",
				"SOLID-Prinzipien",
				"Code-Review",
				"Pair-Programming"
			],
			"logo": "/assets/42_logo.png"
		},
		{
			"id": 1,
			"title": "Pharmazeutisch-technischer Assistent",
			"company": "Galenica",
			"duration": "Oktober 2019 - März 2024 · 4 Jahre 6 Monate",
			"location": "Genf, Schweiz · Vor Ort (Amavita Apotheke)",
			"description": "Meine Rolle als pharmazeutisch-technischer Assistent ermöglichte es mir, wesentliche Fähigkeiten im Bestandsmanagement, der Nutzung spezialisierter digitaler Werkzeuge und der Einhaltung strenger pharmazeutischer Vorschriften zu erwerben. Diese Erfahrung lehrte mich, methodisch zu arbeiten und gleichzeitig ein hohes Maß an Kundenservice aufrechtzuerhalten. Ich stärkte auch meine Fähigkeit, effektiv mit Teams zusammenzuarbeiten, um technologische Innovationen zu integrieren und logistische Prozesse zu verbessern. Ich entwickelte ein tiefes Verständnis für pharmazeutische Produkte und Kundenbedürfnisse, was es mir ermöglichte, genaue und personalisierte Beratung zu bieten. Darüber hinaus nahm ich an kontinuierlichen Schulungen teil, um über die neuesten Entwicklungen im pharmazeutischen Bereich auf dem Laufenden zu bleiben.",
			"tasks": [
				"Kunden beraten und Medikamente gemäß ärztlichen Verschreibungen abgeben.",
				"Bestände verwalten, Bestellungen aufgeben und Prozesse optimieren, um Engpässe zu vermeiden.",
				"ERP-Tools für das pharmazeutische Management verwenden, einschließlich der Rückverfolgbarkeit von Medikamenten.",
				"Einhaltung der pharmazeutischen Vorschriften und Sicherstellung, dass die Praktiken der Apotheke konform sind.",
				"Digitale und logistische Arbeitsabläufe verbessern, um die betriebliche Effizienz zu steigern.",
				"Zusammenarbeit mit dem Team zur Integration technologischer Innovationen und Verbesserung der angebotenen Dienstleistungen.",
				"Teilnahme an kontinuierlichen Schulungen, um über neue Vorschriften und Technologien auf dem Laufenden zu bleiben."
			],
			"skills": [
				"ERP",
				"Pharmazeutische Managementsoftware",
				"Bestandsmanagement",
				"Regulatorische Compliance",
				"Workflow-Optimierung",
				"Kundenservice",
				"Teamzusammenarbeit",
				"Technologische Anpassungsfähigkeit",
				"Inventarverwaltung",
				"Kundengesprächstechniken",
				"Logistische Organisation",
				"Pharmazeutisches Wissen",
				"Kontinuierliche Prozessverbesserung",
				"Kontinuierliche Schulung",
				"Medikamentenrückverfolgbarkeit",
				"Personalisierte Beratung",
				"Verständnis für pharmazeutische Produkte"
			],
			"logo": "/assets/galenica_logo.png"
		}
	]
}
