{
	"experiences": [
		{
			"id": 3,
			"title": "Junior IT Engineer",
			"company": "Vaud Chamber of Commerce and Industry (CVCI)",
			"duration": "Current position, started in October 2024",
			"location": "Lausanne, Vaud, Switzerland · On-site (Hybrid)",
			"description": "As a junior IT engineer, I have had the opportunity to work on various and complex technical projects in a dynamic environment. This experience has strengthened my skills in system administration, cybersecurity, and network infrastructure management. Working with Microsoft tools (Office 365, Azure) has allowed me to specialize in cloud and automation environments. I have also developed a proactive approach to solving technical problems while closely collaborating with multidisciplinary teams to provide tailored and innovative solutions. My role has also allowed me to participate in the strategic planning of IT projects, improve existing processes, and document technical procedures to ensure continuity and operational efficiency.",
			"tasks": [
				"Manage user access and ensure their security by implementing robust security policies.",
				"Maintain and administer IT systems, ensuring their availability and performance.",
				"Resolve complex technical issues by analyzing root causes and implementing sustainable solutions.",
				"Oversee ongoing and upcoming IT projects by coordinating resources and meeting deadlines.",
				"Collaborate with teams on client solutions by understanding their needs and proposing tailored solutions.",
				"Use Microsoft tools like Office 365 and Azure to automate processes and improve efficiency.",
				"Participate in the strategic planning of IT projects by identifying improvement opportunities and proposing innovative initiatives.",
				"Document technical procedures and train users to ensure optimal system usage."
			],
			"skills": [
				"Microsoft Azure",
				"Microsoft Dynamics",
				"ERP Microsoft Dynamics",
				"CRM Microsoft Dynamics",
				"Microsoft 365 Administration",
				"Microsoft Dynamics 365",
				"Microsoft Power Automate",
				"System Automation",
				"Network Administration",
				"Security Management Systems",
				"Cloud Computing",
				"Cybersecurity",
				"Network Security",
				"Virtualization",
				"Process Improvement",
				"IT Project Management",
				"Complex Problem Solving",
				"Interdisciplinary Collaboration",
				"Advanced Technical Support",
				"IT Strategic Planning",
				"Technical Documentation",
				"User Training",
				"Root Cause Analysis",
				"Resource Coordination",
				"Process Automation"
			],
			"logo": "/assets/cvci_logo.png"
		},
		{
			"id": 2,
			"title": "Software Developer (Student)",
			"company": "42 Lausanne",
			"duration": "October 2023 - October 2024 · 1 year",
			"location": "Renens, Vaud, Switzerland · On-site (Hybrid)",
			"description": "My experience at 42 Lausanne was a complete immersion in software development and problem-solving methodologies. I acquired advanced programming skills, learned to collaborate effectively on group projects, and developed innovative solutions. This training strengthened my rigor, autonomy, and adaptability in a demanding environment. I also had the opportunity to work on real projects, which allowed me to put my theoretical knowledge into practice and develop a deep understanding of software development cycles.",
			"tasks": [
				"Complete intensive software development projects, from design to production.",
				"Collaborate with other students in an innovative and stimulating environment, promoting learning by doing.",
				"Acquire skills in solving complex problems and optimizing code.",
				"Learn and apply best programming practices, including design patterns and SOLID principles.",
				"Work on projects independently with strict deadlines, ensuring code quality and performance.",
				"Use version control tools like Git for version control and collaboration.",
				"Participate in code reviews and pair programming sessions to improve code quality and share knowledge."
			],
			"skills": [
				"C",
				"C++",
				"Python",
				"Linux",
				"Shell scripting",
				"Git",
				"Algorithms",
				"Problem Solving",
				"Team Collaboration",
				"Web Development",
				"Autonomy",
				"Rigor",
				"Software Solution Design",
				"Technical Creativity",
				"Software Project Management",
				"Code Optimization",
				"Performance Analysis",
				"Docker",
				"HTML",
				"CSS",
				"JavaScript",
				"Bootstrap",
				"Django",
				"Networking",
				"MySQL",
				"PostgreSQL",
				"HTTP",
				"HTTPS",
				"PHP",
				"2D Graphics",
				"3D Graphics",
				"Multithreading",
				"Design Patterns",
				"SOLID Principles",
				"Code Review",
				"Pair Programming"
			],
			"logo": "/assets/42_logo.png"
		},
		{
			"id": 1,
			"title": "Pharmacy Assistant",
			"company": "Galenica",
			"duration": "October 2019 - March 2024 · 4 years 6 months",
			"location": "Geneva, Switzerland · On-site (Amavita Pharmacy)",
			"description": "My role as a pharmacy assistant allowed me to acquire essential skills in stock management, the use of specialized digital tools, and compliance with strict pharmaceutical regulations. This experience taught me to work methodically while maintaining a high level of customer service. I also strengthened my ability to collaborate effectively with teams to integrate technological innovations and improve logistical processes. I developed a deep understanding of pharmaceutical products and customer needs, which enabled me to provide accurate and personalized advice. Additionally, I participated in continuous training to stay up-to-date with the latest advancements in the pharmaceutical field.",
			"tasks": [
				"Advise customers and dispense medications according to medical prescriptions.",
				"Manage stocks, place orders, and optimize processes to avoid stockouts.",
				"Use ERP tools for pharmaceutical management, including medication traceability.",
				"Comply with pharmaceutical regulations and ensure the pharmacy's practices are compliant.",
				"Improve digital and logistical workflows to increase operational efficiency.",
				"Collaborate with the team to integrate technological innovations and improve services offered.",
				"Participate in continuous training to stay up-to-date with new regulations and technologies."
			],
			"skills": [
				"ERP",
				"Pharmaceutical Management Software",
				"Stock Management",
				"Regulatory Compliance",
				"Workflow Optimization",
				"Customer Service",
				"Team Collaboration",
				"Technological Adaptability",
				"Inventory Management",
				"Customer Counseling Techniques",
				"Logistical Organization",
				"Pharmaceutical Knowledge",
				"Continuous Process Improvement",
				"Continuous Training",
				"Medication Traceability",
				"Personalized Advice",
				"Understanding of Pharmaceutical Products"
			],
			"logo": "/assets/galenica_logo.png"
		}
	]
}
