{
	"categories": [
		{
			"name": "Personal Projects",
			"logo": "/assets/personnal_logo.png",
			"projects": [
				{
					"title": "Personal HomeLab",
					"description": "Deployment of a complete HomeLab on a Debian server with AI, DevOps, virtualization, and secure VPN access.",
					"detail": "Installation and configuration of a Debian server on a repurposed physical machine to host a personal HomeLab using CasaOS. Setup of Tailscale for secure remote access with end-to-end encryption. Deployment and management of advanced services via Docker: local AI chatbot (Ollama + Open WebUI), development environment (VSCode Server, Gitea), productivity tools (Ghostfolio, Wallos, LibreTranslate, Stirling PDF, Excalidraw), and sandboxed virtualization solution (KASM Workspaces). Log centralization through Dozzle. All services are containerized, isolated, and only accessible through the VPN. This project applies best practices in system administration, network security, virtualization, and DevOps, leveraging modern open-source self-hosted tools.",
					"technologies": [
						"Debian 12",
						"CasaOS",
						"Docker Compose",
						"Docker Volume Management",
						"Reverse Proxy (CasaOS/Nginx built-in)",
						"Ollama (local AI optimized for CPU)",
						"Open WebUI",
						"VSCode Server (dev container)",
						"Gitea (self-hosted Git server)",
						"Dozzle (Docker log viewer)",
						"Tailscale (encrypted mesh VPN)",
						"Telegram Bot API (push notifications)",
						"Wallos (self-hosted task manager)",
						"Ghostfolio (wealth management)",
						"LibreTranslate (offline translation)",
						"Stirling PDF (local PDF tools)",
						"Excalidraw (collaborative whiteboard)",
						"KASM Workspaces (sandboxed virtualization)",
						"Port and network access hardening",
						"Local monitoring (logs & system via UI)"
					],
					"date": "April 2025",
					"repo": "",
					"logo": "/assets/projects/homelab.png"
				},
				{
					"title": "Automated Trading Bot",
					"description": "Development of a crypto trading bot using Freqtrade, a custom DCA strategy, and a UI interface accessible via Cloudflare Tunnel.",
					"detail": "Creation of an automated trading bot based on Freqtrade, integrating an advanced Dollar-Cost Averaging (DCA) strategy optimized for a minimum annual return of 15%. The bot monitors market trends and applies intelligent buy and sell orders based on technical indicators. Performance has been validated through backtests over several years: 2022 (15.05%), 2023 (17.83%), and 2024 (16.42%). The application is deployed on an on-premise Linux server, ensuring full control over the infrastructure. Virtualization via Docker ensures optimal service isolation and facilitates updates and scalability management. A user interface via Freqtrade UI allows real-time tracking of open positions, performance, and transaction history. A Cloudflare tunnel has been set up to secure remote access to the interface and ensure smooth bot management without direct exposure to the Internet.",
					"technologies": [
						"Python",
						"Freqtrade",
						"PostgreSQL",
						"Docker",
						"Binance API",
						"Pandas",
						"NumPy",
						"Telegram API",
						"Freqtrade UI",
						"Cloudflare Tunnel",
						"Reverse Proxy",
						"Raspberry Pi",
						"Virtualization"
					],
					"date": "February 2025",
					"repo": "",
					"logo": "/assets/projects/cryptobot.png"
				},
				{
					"title": "Portfolio Website",
					"description": "Creation of an interactive portfolio to showcase my achievements.",
					"detail": "Development of an interactive website to showcase my professional and personal projects. The site is hosted on Azure Static Web Apps for optimal performance and simplified deployment management. The domain name is managed by Infomaniak. A custom routing service in pure JavaScript is used for smooth navigation between different sections of the site, ensuring the Single Page Application principle. The design is minimalist and modern thanks to the use of picoCSS.",
					"technologies": [
						"HTML",
						"CSS",
						"JavaScript",
						"Azure Static Web Apps",
						"picoCSS"
					],
					"date": "November 2024",
					"repo": "https://github.com/aceyzz/personnal_portfolio",
					"logo": "assets/projects/portfolio.png"
				}
			]
		},
		{
			"name": "42 - Specializations",
			"logo": "/assets/42_logo.png",
			"projects": [
				{
					"title": "Cloud-1",
					"description": "Implementation of a complete WordPress environment with Docker Compose on Azure.",
					"detail": "This project involves creating a complete WordPress environment using Docker containers for WordPress, MariaDB, phpMyAdmin, and Nginx, deployed on an Azure VM. The containers are orchestrated with Docker Compose and automated via Ansible for deployment and configuration. The environment uses SSL certificates to secure connections and ensures data persistence for MariaDB and WordPress.",
					"technologies": [
						"Docker",
						"Ansible",
						"Azure",
						"WordPress",
						"MariaDB",
						"Nginx",
						"phpMyAdmin",
						"SSL"
					],
					"date": "November 2024",
					"repo": "https://github.com/aceyzz/cloud-1",
					"logo": "/assets/projects/cloud-1.png"
				}
			]
		},
		{
			"name": "42 - Common Core",
			"logo": "/assets/42_logo.png",
			"projects": [
				{
					"title": "Libft",
					"description": "Recreate the main functions of the C standard library.",
					"detail": "Development of a personal library by recreating several essential functions of the C standard library, focusing on best practices and efficient memory management.",
					"technologies": [
						"C",
						"Makefile"
					],
					"date": "October 2023",
					"repo": "https://github.com/aceyzz/Libft",
					"logo": "/assets/projects/libft.png"
				},
				{
					"title": "Get Next Line",
					"description": "Read a line from a file in an optimized way.",
					"detail": "Creation of a function capable of reading line by line from a file or standard input, using buffers to optimize performance.",
					"technologies": [
						"C"
					],
					"date": "November 2023",
					"repo": "https://github.com/aceyzz/Get_next_line",
					"logo": "/assets/projects/gnl.png"
				},
				{
					"title": "Ft_printf",
					"description": "Reproduce the printf function from the C standard library.",
					"detail": "Development of a custom version of the printf function, supporting multiple formats and specifications, while efficiently managing memory.",
					"technologies": [
						"C"
					],
					"date": "November 2023",
					"repo": "https://github.com/aceyzz/Ft_printf",
					"logo": "/assets/projects/printf.png"
				},
				{
					"title": "Born2BeRoot",
					"description": "Configure a secure virtual machine.",
					"detail": "Installation and configuration of a secure virtual machine based on Debian. This project covers several essential aspects of system management, including downloading and installing the virtual machine, initial configuration, connecting via SSH, and setting up strict security policies. The concepts covered include virtualization with VirtualBox, permission and user management, installation and configuration of essential services like SSH and UFW, as well as setting up robust password policies and security logs.",
					"technologies": [
						"Linux",
						"VirtualBox",
						"Debian",
						"SSH",
						"UFW",
						"Sudo",
						"Crontab"
					],
					"date": "November 2023",
					"repo": "https://github.com/aceyzz/Born2beRoot",
					"logo": "/assets/projects/b2r.png"
				},
				{
					"title": "Push_Swap",
					"description": "Implement a sorting algorithm with a limited number of operations.",
					"detail": "The push_swap project involves developing a program in C that takes a list of integers as a command-line argument and displays a sequence of operations to sort these integers optimally. The program uses two stacks, 'a' and 'b', and a limited set of stack manipulation operations to sort the integers. The allowed operations include swaps, rotations, and push operations between the stacks. The goal is to minimize the total number of operations performed to sort the stack.",
					"technologies": [
						"C"
					],
					"date": "November 2023",
					"repo": "https://github.com/aceyzz/Push_swap",
					"logo": "/assets/projects/pushswap.png"
				},
				{
					"title": "Minitalk",
					"description": "Create a client-server application to exchange messages via Unix signals.",
					"detail": "Development of a simple client-server communication system using Unix signals as the transmission medium. The client sends a message to the server, which receives and displays it. The client converts each character of the message into a sequence of bits and sends them to the server using SIGUSR1 and SIGUSR2 signals. The server reconstructs the message from the received bits and displays it. The server confirms the receipt of each message by sending a signal back to the client. The project also includes bonus features such as support for Unicode characters.",
					"technologies": [
						"C",
						"Unix",
						"Signals"
					],
					"date": "November 2023",
					"repo": "https://github.com/aceyzz/Minitalk",
					"logo": "/assets/projects/minitalk.png"
				},
				{
					"title": "So_Long",
					"description": "Develop a 2D game in C based on a graphics library.",
					"detail": "Welcome to So_Long, a 2D game project developed in C as part of a programming learning program. This project focuses on creating a simple game using the MinilibX graphics library. The goal is to build a game where a player moves through a map, collects objects, avoids obstacles, and reaches the exit. The game involves managing user inputs, rendering graphics, and handling game elements such as the player, objects, obstacles, and the exit. The project includes event management, animations, and interactions with the environment.",
					"technologies": [
						"C",
						"MinilibX",
						"Graphics"
					],
					"date": "November 2023",
					"repo": "https://github.com/aceyzz/So_long",
					"logo": "/assets/projects/solong.png"
				},
				{
					"title": "Philosophers",
					"description": "Simulation of a classic multithreading algorithm problem.",
					"detail": "This program implements the simulation of the classic dining philosophers problem using threads and mutexes in C. The simulation involves philosophers alternating between eating, thinking, and sleeping. They use forks to eat and put them back on the table when they are done. Philosophers must never starve, and the simulation stops when a philosopher dies of starvation. The program must be written without using global variables and should take arguments such as the number of philosophers, time limits for eating, sleeping, and dying, as well as an optional argument for the number of meals each philosopher must have before the simulation stops. The program should also handle event logging and ensure philosophers avoid starvation. The program can be implemented either with threads and mutexes or with processes and semaphores (in my case, threads & mutexes).",
					"technologies": [
						"C",
						"Multithreading"
					],
					"date": "December 2023",
					"repo": "https://github.com/aceyzz/Philosophers",
					"logo": "/assets/projects/philo.png"
				},
				{
					"title": "Minishell",
					"description": "Creation of a minimalist shell inspired by Bash.",
					"detail": "In our 'Minishell' project at 42 school, we are developing a simplified shell program. This challenge is crucial for our understanding of processes and file descriptors. Our goal is to create a minimalist version of bash, immersing ourselves in the nuances of shell programming. We focus on fundamental aspects such as command input handling, file directory manipulation, environment variable interpretation, and implementing essential features like signal handling and command execution. This project represents an important step towards a deep understanding of system programming, offering practical experience with key concepts used in Unix/Linux shell environments.",
					"technologies": [
						"C",
						"Unix",
						"Shell"
					],
					"date": "January 2024",
					"repo": "https://github.com/aceyzz/Minishell",
					"logo": "/assets/projects/shell.png"
				},
				{
					"title": "Cub3D",
					"description": "Development of a 3D game inspired by Wolfenstein 3D using ray-casting.",
					"detail": "This project involves creating a 3D first-person game using ray-casting to render a maze. The game is developed with the MiniLibX graphics library and includes features such as player movement, shooting, and texture management.",
					"technologies": [
						"C",
						"MiniLibX",
						"Ray-casting"
					],
					"date": "January 2024",
					"repo": "https://github.com/aceyzz/cub3d",
					"logo": "/assets/projects/cube.png"
				},
				{
					"title": "NetPractice",
					"description": "Learning fundamental networking concepts.",
					"detail": "The NetPractice project is an exciting challenge offered by 42 school that aims to deepen and apply my skills in computer networking. This project is a unique opportunity for me to dive into the complex and fascinating world of networks, learning to manipulate, configure, and troubleshoot in real and simulated network environments. Objectives include understanding networking fundamentals, including the OSI and TCP/IP models, mastering the configuration and management of network devices such as switches and routers, and applying troubleshooting techniques to identify and resolve network issues.",
					"technologies": [
						"Networking",
						"OSI Model",
						"TCP/IP",
						"Switches",
						"Routers",
						"Troubleshooting"
					],
					"date": "February 2024",
					"repo": "https://github.com/aceyzz/NetPractice",
					"logo": "/assets/projects/ip.png"
				},
				{
					"title": "Piscine C++ (part.1)",
					"description": "Introduction to object-oriented programming in C++.",
					"detail": "Discovering the basics of object-oriented programming with C++. Focus on classes, objects, and modularity. Understanding ad-hoc polymorphism, overloading, and orthodox canonical classes in C++. Learning about memory allocation, references, member pointers, and the use of switch in C++. Exploring the specifics of C++ compared to C, with a dive into object-oriented programming. Studying subtype polymorphism, abstract classes, and interfaces in C++. Understanding inheritance in C++ and its implications for designing robust and modular software.",
					"technologies": [
						"C++"
					],
					"date": "March 2024",
					"repo": "https://github.com/aceyzz/CPP-Part.1",
					"logo": "/assets/projects/cplusplus.png"
				},
				{
					"title": "Piscine C++ (part.2)",
					"description": "Deepening advanced C++ concepts.",
					"detail": "Deepening advanced C++ features such as templates, different types of casts, the use of standard containers (STL), template containers, iterators, and algorithms, as well as exception handling with Try/Catch blocks. The project also includes implementing generic programming concepts, manipulating smart pointers, and optimizing performance through advanced memory management techniques.",
					"technologies": [
						"C++"
					],
					"date": "March 2024",
					"repo": "https://github.com/aceyzz/CPP-Part.2",
					"logo": "/assets/projects/cplusplus.png"
				},
				{
					"title": "Inception",
					"description": "Deployment of a complex and secure web infrastructure with Docker.",
					"detail": "As part of our curriculum at 42 school, we will tackle the project titled 'Inception'. This ambitious project aims to deepen and apply the knowledge acquired in virtualization and container management. Our goal is to deploy a complex and secure infrastructure, fully configured using Docker and orchestrated by docker-compose, all within a dedicated virtual machine. The architecture includes several key components: a Docker container with NGINX, a container dedicated to WordPress + php-fpm, a container for MariaDB, two distinct volumes for the database and website files, and a specific Docker network for inter-container communication. The containers must be built from custom Dockerfiles, without using pre-built Docker images or services like DockerHub.",
					"technologies": [
						"Docker",
						"WordPress",
						"MariaDB",
						"php-fpm",
						"Nginx",
						"TLS",
						"Docker Compose",
						"Virtualization"
					],
					"date": "March 2024",
					"repo": "https://github.com/aceyzz/Inception",
					"logo": "/assets/projects/inception.png"
				},
				{
					"title": "Webserv",
					"description": "Implementation of a web server in C++ following the HTTP protocol.",
					"detail": "The Webserv project at 42 school involves implementing a web server in C++ according to the C++98 standard. This server must be capable of serving static files and handling CGI requests. It must also handle multiple simultaneous connections, large files asynchronously and non-blockingly. Additionally, the server must support HTTP GET, POST, and DELETE methods, as well as CGI requests for GET and POST. It should handle errors and return appropriate HTTP status codes. The server must also manage requests with large headers and bodies, with a limit defined in the configuration file. The reference behavior for this project is that of Nginx.",
					"technologies": [
						"C++",
						"Networking",
						"HTTP",
						"CGI",
						"Asynchronous I/O",
						"SSL"
					],
					"date": "August 2024",
					"repo": "https://github.com/aceyzz/webserv",
					"logo": "/assets/projects/web.png"
				},
				{
					"title": "Ft_Transcendence",
					"description": "Development of a complete web application for an online multiplayer game.",
					"detail": "Creation of a web platform for a real-time multiplayer game, including WebSocket. The project includes user management, local and remote multiplayer support, a tournament system, statistics boards, and advanced security measures such as password hashing and protection against XSS/SQL Injection attacks. The backend is managed by a custom Web module, the database is integrated, and the frontend uses JavaScript with a modern toolkit. The application is a SPA compatible with Chrome, without console errors, and launches with a single command.",
					"technologies": [
						"HTML",
						"CSS",
						"JavaScript",
						"Django",
						"WebSocket",
						"PostgreSQL",
						"Docker",
						"Modsecurity",
						"Nginx",
						"HashiCorp Vault"
					],
					"date": "October 2024",
					"repo": "https://github.com/aceyzz/ft_transcendence",
					"logo": "/assets/projects/pong.png"
				}
			]
		},
		{
			"name": "42 - Piscine",
			"logo": "/assets/42_logo.png",
			"projects": [
				{
					"title": "Shell Modules",
					"description": "Introduction to shell scripting and Unix command management.",
					"detail": "This project explores the basics of shell scripting, essential Unix commands, and their usage in a Linux environment. The goal is to learn how to automate common tasks.",
					"technologies": [
						"Shell scripting",
						"Unix"
					],
					"date": "September 2023",
					"repo": "https://github.com/aceyzz/42-Piscine/tree/main/shell_modules",
					"logo": "/assets/projects/modules_shell.png"
				},
				{
					"title": "C Modules",
					"description": "Introduction to the basics of the C language, logic, and simple algorithms.",
					"detail": "Learning the basics of the C language, including data structures, loops, and functions. The projects also focus on algorithmic logic and compilation tools.",
					"technologies": [
						"C"
					],
					"date": "September 2023",
					"repo": "https://github.com/aceyzz/42-Piscine/tree/main/c_modules",
					"logo": "/assets/projects/modules_c.png"
				},
				{
					"title": "Rushes",
					"description": "Intensive team challenges to solve complex problems.",
					"detail": "Collaborative work on complex challenges with tight deadlines, aiming to improve problem-solving skills and team communication.",
					"technologies": [
						"C",
						"Collaborative work"
					],
					"date": "September 2023",
					"repo": "https://github.com/aceyzz/42-Piscine/tree/main/rushes",
					"logo": "/assets/projects/rushes.png"
				}
			]
		}
	]
}