{
	"experiences": [
		{
			"id": 3,
			"title": "Ingénieur IT junior",
			"company": "Chambre Vaudoise du Commerce et de l'Industrie (CVCI)",
			"duration": "Poste actuel, démarré en Octobre 2024",
			"location": "Lausanne, Vaud, Suisse · Sur site (Hybride)",
			"description": "En tant qu’ingénieur IT junior, j’ai eu l’opportunité de travailler sur des projets techniques variés et complexes dans un environnement dynamique. Cette expérience a consolidé mes compétences en administration système, cybersécurité et gestion des infrastructures réseau. Travailler avec les outils Microsoft (Office 365, Azure) m’a permis de me spécialiser dans des environnements cloud et d’automatisation. J’ai également développé une approche proactive pour résoudre les problèmes techniques tout en collaborant étroitement avec des équipes pluridisciplinaires pour fournir des solutions adaptées et innovantes. Mon rôle m'a également permis de participer à la planification stratégique des projets IT, d'améliorer les processus existants et de documenter les procédures techniques pour assurer une continuité et une efficacité opérationnelle.",
			"tasks": [
				"Gérer les accès utilisateurs et assurer leur sécurité, en mettant en place des politiques de sécurité robustes.",
				"Maintenir et administrer les systèmes informatiques, en assurant leur disponibilité et leur performance.",
				"Résoudre des problèmes techniques complexes, en analysant les causes profondes et en mettant en œuvre des solutions durables.",
				"Superviser les projets IT en cours et à venir, en coordonnant les ressources et en respectant les délais.",
				"Collaborer avec les équipes sur des solutions client, en comprenant leurs besoins et en proposant des solutions adaptées.",
				"Utiliser les outils Microsoft comme Office 365 et Azure pour automatiser les processus et améliorer l'efficacité.",
				"Participer à la planification stratégique des projets IT, en identifiant les opportunités d'amélioration et en proposant des initiatives innovantes.",
				"Documenter les procédures techniques et former les utilisateurs pour assurer une utilisation optimale des systèmes."
			],
			"skills": [
				"Microsoft Azure",
				"Microsoft Dynamics",
				"ERP Microsoft Dynamics",
				"CRM Microsoft Dynamics",
				"Administration Microsoft 365",
				"Microsoft Dynamics 365",
				"Microsoft Power Automate",
				"Automatisation des systèmes",
				"Administration réseau",
				"Systèmes de gestion de la sécurité",
				"Cloud Computing",
				"Cybersécurité",
				"Sécurité réseau",
				"Virtualisation",
				"Amélioration des processus",
				"Gestion de projets IT",
				"Résolution de problèmes complexes",
				"Collaboration interdisciplinaire",
				"Support technique avancé",
				"Planification stratégique IT",
				"Documentation technique",
				"Formation des utilisateurs",
				"Analyse des causes profondes",
				"Coordination des ressources",
				"Automatisation des processus"
			],
			"logo": "/assets/cvci_logo.png"
		},
		{
			"id": 2,
			"title": "Développeur Software (étudiant)",
			"company": "42 Lausanne",
			"duration": "Octobre 2023 - Octobre 2024 · 1 an",
			"location": "Renens, Vaud, Suisse · Sur site (Hybride)",
			"description": "Mon expérience à 42 Lausanne a été une immersion complète dans le développement logiciel et les méthodologies de résolution de problèmes. J’ai acquis des compétences avancées en programmation, appris à collaborer efficacement dans des projets en groupe, et à développer des solutions innovantes. Cette formation m'a permis de renforcer ma rigueur, mon autonomie, et ma capacité d'adaptation dans un environnement exigeant. J'ai également eu l'opportunité de travailler sur des projets réels, ce qui m'a permis de mettre en pratique mes connaissances théoriques et de développer une compréhension approfondie des cycles de développement logiciel.",
			"tasks": [
				"Réaliser des projets intensifs en développement logiciel, allant de la conception à la mise en production.",
				"Collaborer avec d'autres étudiants dans un cadre innovant et stimulant, favorisant l'apprentissage par la pratique.",
				"Acquérir des compétences en résolution de problèmes complexes et en optimisation de code.",
				"Apprendre et appliquer les bonnes pratiques en programmation, y compris les design patterns et les principes SOLID.",
				"Travailler sur des projets en autonomie avec des deadlines strictes, tout en assurant la qualité et la performance du code.",
				"Utiliser des outils de gestion de version comme Git pour le contrôle de version et la collaboration.",
				"Participer à des revues de code et à des sessions de pair programming pour améliorer la qualité du code et partager les connaissances."
			],
			"skills": [
				"C",
				"C++",
				"Python",
				"Linux",
				"Shell scripting",
				"Git",
				"Algorithmique",
				"Résolution de problèmes",
				"Collaboration en équipe",
				"Développement web",
				"Autonomie",
				"Rigueur",
				"Conception de solutions logicielles",
				"Créativité technique",
				"Gestion de projet logiciel",
				"Optimisation de code",
				"Analyse de performance",
				"Docker",
				"HTML",
				"CSS",
				"JavaScript",
				"Bootstrap",
				"Django",
				"Réseau",
				"MySQL",
				"PostgreSQL",
				"HTTP",
				"HTTPS",
				"PHP",
				"Graphismes 2D",
				"Graphismes 3D",
				"Multithreading",
				"Design patterns",
				"Principes SOLID",
				"Revue de code",
				"Pair programming"
			],
			"logo": "/assets/42_logo.png"
		},
		{
			"id": 1,
			"title": "Assistant en Pharmacie",
			"company": "Galenica",
			"duration": "Octobre 2019 - Mars 2024 · 4 ans 6 mois",
			"location": "Genève, Suisse · Sur site (Pharmacie Amavita)",
			"description": "Mon rôle en tant qu’assistant en pharmacie m’a permis d’acquérir des compétences essentielles dans la gestion des stocks, l’utilisation d’outils numériques spécialisés, et la conformité aux réglementations strictes du secteur pharmaceutique. Cette expérience m’a appris à travailler de manière méthodique tout en maintenant un haut niveau de service client. J’ai également renforcé ma capacité à collaborer efficacement avec des équipes pour intégrer des innovations technologiques et améliorer les processus logistiques. J'ai développé une compréhension approfondie des produits pharmaceutiques et des besoins des clients, ce qui m'a permis de fournir des conseils précis et personnalisés. De plus, j'ai participé à des formations continues pour rester à jour avec les dernières avancées dans le domaine pharmaceutique.",
			"tasks": [
				"Conseiller les clients et délivrer des médicaments en respectant les prescriptions médicales.",
				"Gérer les stocks, passer des commandes et optimiser les processus pour éviter les ruptures de stock.",
				"Utiliser des outils ERP pour la gestion pharmaceutique, y compris la traçabilité des médicaments.",
				"Respecter les réglementations pharmaceutiques et assurer la conformité des pratiques de la pharmacie.",
				"Améliorer les workflows numériques et logistiques pour accroître l'efficacité opérationnelle.",
				"Collaborer avec l’équipe pour intégrer des innovations technologiques et améliorer les services offerts.",
				"Participer à des formations continues pour rester à jour avec les nouvelles réglementations et technologies."
			],
			"skills": [
				"ERP",
				"Logiciels de gestion pharmaceutique",
				"Gestion des stocks",
				"Conformité réglementaire",
				"Optimisation des workflows",
				"Service client",
				"Collaboration d'équipe",
				"Adaptabilité technologique",
				"Gestion des inventaires",
				"Techniques de conseil client",
				"Organisation logistique",
				"Connaissances pharmaceutiques",
				"Amélioration continue des processus",
				"Formation continue",
				"Traçabilité des médicaments",
				"Conseils personnalisés",
				"Compréhension des produits pharmaceutiques"
			],
			"logo": "/assets/galenica_logo.png"
		}
	]
}
